node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 360
        }
        dim {
          size: 480
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\r\000\000\000"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.20412415266
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20412415266
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/max"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/RandomUniform"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Initializer/random_uniform"
  op: "Add"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/mul"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/Assign"
  op: "Assign"
  input: "ENet/initial_block_1_conv/weights"
  input: "ENet/initial_block_1_conv/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/weights/read"
  op: "Identity"
  input: "ENet/initial_block_1_conv/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000199999994948
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "ENet/initial_block_1_conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "ENet/initial_block_1_conv/kernel/Regularizer/l2_regularizer/scale"
  input: "ENet/initial_block_1_conv/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/weights"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 13
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/biases/Assign"
  op: "Assign"
  input: "ENet/initial_block_1_conv/biases"
  input: "ENet/initial_block_1_conv/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/biases/read"
  op: "Identity"
  input: "ENet/initial_block_1_conv/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/bias/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000199999994948
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/bias/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "ENet/initial_block_1_conv/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/bias/Regularizer/l2_regularizer"
  op: "Mul"
  input: "ENet/initial_block_1_conv/bias/Regularizer/l2_regularizer/scale"
  input: "ENet/initial_block_1_conv/bias/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_conv/biases"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/Conv2D"
  op: "Conv2D"
  input: "input"
  input: "ENet/initial_block_1_conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_conv/BiasAdd"
  op: "BiasAdd"
  input: "ENet/initial_block_1_conv/Conv2D"
  input: "ENet/initial_block_1_conv/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 13
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 13
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/beta/Assign"
  op: "Assign"
  input: "ENet/initial_block_1_batchnorm/beta"
  input: "ENet/initial_block_1_batchnorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/beta/read"
  op: "Identity"
  input: "ENet/initial_block_1_batchnorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/beta"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 13
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_mean/Assign"
  op: "Assign"
  input: "ENet/initial_block_1_batchnorm/moving_mean"
  input: "ENet/initial_block_1_batchnorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_mean/read"
  op: "Identity"
  input: "ENet/initial_block_1_batchnorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_mean"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 13
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_variance/Assign"
  op: "Assign"
  input: "ENet/initial_block_1_batchnorm/moving_variance"
  input: "ENet/initial_block_1_batchnorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/moving_variance/read"
  op: "Identity"
  input: "ENet/initial_block_1_batchnorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_batchnorm/moving_variance"
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "ENet/initial_block_1_conv/BiasAdd"
  input: "ENet/initial_block_1_batchnorm/Const"
  input: "ENet/initial_block_1_batchnorm/beta/read"
  input: "ENet/initial_block_1_batchnorm/moving_mean/read"
  input: "ENet/initial_block_1_batchnorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "ENet/initial_block_1_batchnorm/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_prelualpha/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_prelualpha"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 13
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_prelualpha"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_prelualpha"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/initial_block_1_prelualpha/Assign"
  op: "Assign"
  input: "ENet/initial_block_1_prelualpha"
  input: "ENet/initial_block_1_prelualpha/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_prelualpha"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/initial_block_1_prelualpha/read"
  op: "Identity"
  input: "ENet/initial_block_1_prelualpha"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/initial_block_1_prelualpha"
      }
    }
  }
}
node {
  name: "ENet/Relu"
  op: "Relu"
  input: "ENet/initial_block_1_batchnorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/Abs"
  op: "Abs"
  input: "ENet/initial_block_1_batchnorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/sub"
  op: "Sub"
  input: "ENet/initial_block_1_batchnorm/FusedBatchNorm"
  input: "ENet/Abs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/mul"
  op: "Mul"
  input: "ENet/initial_block_1_prelualpha/read"
  input: "ENet/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/mul_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "ENet/mul_1"
  op: "Mul"
  input: "ENet/mul"
  input: "ENet/mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/add"
  op: "Add"
  input: "ENet/Relu"
  input: "ENet/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/initial_block_1_max_pool/MaxPool"
  op: "MaxPool"
  input: "input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "ENet/initial_block_1_concat"
  op: "ConcatV2"
  input: "ENet/add"
  input: "ENet/initial_block_1_max_pool/MaxPool"
  input: "ENet/initial_block_1_concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "ENet/bottleneck1_0_main_max_pool"
  op: "MaxPoolWithArgmax"
  input: "ENet/initial_block_1_concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Targmax"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "ENet/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\0000\000\000\000"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_main_padding"
  op: "Pad"
  input: "ENet/bottleneck1_0_main_max_pool"
  input: "ENet/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\002\000\000\000\002\000\000\000\020\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.273861289024
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.273861289024
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/max"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/RandomUniform"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform"
  op: "Add"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/mul"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 2
        }
        dim {
          size: 16
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_conv1/weights"
  input: "ENet/bottleneck1_0_conv1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/weights/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000199999994948
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "ENet/bottleneck1_0_conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "ENet/bottleneck1_0_conv1/kernel/Regularizer/l2_regularizer/scale"
  input: "ENet/bottleneck1_0_conv1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/biases/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_conv1/biases"
  input: "ENet/bottleneck1_0_conv1/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/biases/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_conv1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/bias/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000199999994948
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/bias/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "ENet/bottleneck1_0_conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/bias/Regularizer/l2_regularizer"
  op: "Mul"
  input: "ENet/bottleneck1_0_conv1/bias/Regularizer/l2_regularizer/scale"
  input: "ENet/bottleneck1_0_conv1/bias/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv1/biases"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/Conv2D"
  op: "Conv2D"
  input: "ENet/initial_block_1_concat"
  input: "ENet/bottleneck1_0_conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv1/BiasAdd"
  op: "BiasAdd"
  input: "ENet/bottleneck1_0_conv1/Conv2D"
  input: "ENet/bottleneck1_0_conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/beta/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_batch_norm1/beta"
  input: "ENet/bottleneck1_0_batch_norm1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/beta/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_batch_norm1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/beta"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_mean/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_batch_norm1/moving_mean"
  input: "ENet/bottleneck1_0_batch_norm1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_mean/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_batch_norm1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_mean"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_variance/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_batch_norm1/moving_variance"
  input: "ENet/bottleneck1_0_batch_norm1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/moving_variance/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_batch_norm1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_batch_norm1/moving_variance"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "ENet/bottleneck1_0_conv1/BiasAdd"
  input: "ENet/bottleneck1_0_batch_norm1/Const"
  input: "ENet/bottleneck1_0_batch_norm1/beta/read"
  input: "ENet/bottleneck1_0_batch_norm1/moving_mean/read"
  input: "ENet/bottleneck1_0_batch_norm1/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "ENet/bottleneck1_0_batch_norm1/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_prelu1alpha/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_prelu1alpha"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_prelu1alpha"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_prelu1alpha"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_prelu1alpha/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_prelu1alpha"
  input: "ENet/bottleneck1_0_prelu1alpha/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_prelu1alpha"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_prelu1alpha/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_prelu1alpha"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_prelu1alpha"
      }
    }
  }
}
node {
  name: "ENet/Relu_1"
  op: "Relu"
  input: "ENet/bottleneck1_0_batch_norm1/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/Abs_1"
  op: "Abs"
  input: "ENet/bottleneck1_0_batch_norm1/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/sub_1"
  op: "Sub"
  input: "ENet/bottleneck1_0_batch_norm1/FusedBatchNorm"
  input: "ENet/Abs_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/mul_2"
  op: "Mul"
  input: "ENet/bottleneck1_0_prelu1alpha/read"
  input: "ENet/sub_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/mul_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "ENet/mul_3"
  op: "Mul"
  input: "ENet/mul_2"
  input: "ENet/mul_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/add_1"
  op: "Add"
  input: "ENet/Relu_1"
  input: "ENet/mul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\004\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.288675129414
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.288675129414
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/max"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/RandomUniform"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform"
  op: "Add"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/mul"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 4
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/Assign"
  op: "Assign"
  input: "ENet/bottleneck1_0_conv2/weights"
  input: "ENet/bottleneck1_0_conv2/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/weights/read"
  op: "Identity"
  input: "ENet/bottleneck1_0_conv2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000199999994948
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "ENet/bottleneck1_0_conv2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "ENet/bottleneck1_0_conv2/kernel/Regularizer/l2_regularizer/scale"
  input: "ENet/bottleneck1_0_conv2/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/weights"
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ENet/bottleneck1_0_conv2/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ENet/bottleneck1_0_conv2/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
